Перем ОбщиеФункции;

Функция ПолучитьСписокТестов(юТест) Экспорт
	
	ПутьКМодулю = ОбъединитьПути(ТекущийСценарий().Каталог, "../src/asserts-commons.os");
	ОбщиеФункции = ЗагрузитьСценарий(ПутьКМодулю);
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_Проверить_ТекстОшибкиРавенстваСтрок");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_Проверить_ТекстОшибкиРавенстваСтрок() Экспорт
	
	ПерваяСтрока = "Это обычная строка";
	ВтораяСтрока = "Это обчная строка";

	ТекстОшибки = ОбщиеФункции.ИсключениеНеравенстваСтрок(ПерваяСтрока, ВтораяСтрока);

	Эталон = "Различия в позиции 7.
	|Строка 1:то обычная
	|         -----^
	|Строка 2:то обчная ";
	
	// TODO: понять, почему не подключаются ассерты
	Если ТекстОшибки <> Эталон Тогда
		ВызватьИсключение "Строки не равны: 
		|" + ТекстОшибки;
	КонецЕсли;

КонецПроцедуры