#Использовать ".."
#Использовать collectionos

&Тест
Процедура ОжидаемСодержитВСписке() Экспорт

	// Дано
	Список = Новый СписокМассив;
	Список.Добавить(1);

	// Когда
	Ожидаем.Что(Список)
		.Содержит(1);

	// Тогда

КонецПроцедуры

&Тест
Процедура ОжидаемНеСодержитВСписке() Экспорт

	// Дано
	БылоИсключение = Ложь;

	Список = Новый СписокМассив;
	Список.Добавить(2);

	// Когда
	Попытка
		Ожидаем.Что(Список)
			.Содержит(1);
	Исключение
		БылоИсключение = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;

	// Тогда
	ПроверитьИсключение(
		БылоИсключение,
		ОписаниеОшибки,
		"Ожидали, что проверяемое значение ([2]) СОДЕРЖИТ (1)"
	);

КонецПроцедуры

&Тест
Процедура ОжидаемСодержитВМножестве() Экспорт

	// Дано
	Множество = Новый МножествоСоответствие;
	Множество.Добавить(1);

	// Когда
	Ожидаем.Что(Множество)
		.Содержит(1);

	// Тогда

КонецПроцедуры

&Тест
Процедура ОжидаемНеСодержитВМножестве() Экспорт

	// Дано
	БылоИсключение = Ложь;

	Множество = Новый МножествоСоответствие;
	Множество.Добавить(2);

	// Когда
	Попытка
		Ожидаем.Что(Множество)
			.Содержит(1);
	Исключение
		БылоИсключение = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;

	// Тогда
	ПроверитьИсключение(
		БылоИсключение,
		ОписаниеОшибки,
		"Ожидали, что проверяемое значение ([2]) СОДЕРЖИТ (1)"
	);

КонецПроцедуры

&Тест
Процедура ОжидаемСодержитВОчереди() Экспорт

	// Дано
	Очередь = Новый ОчередьМассив;
	Очередь.Добавить(1);

	// Когда
	Ожидаем.Что(Очередь)
		.Содержит(1);

	// Тогда

КонецПроцедуры

&Тест
Процедура ОжидаемНеСодержитВОчереди() Экспорт

	// Дано
	БылоИсключение = Ложь;

	Очередь = Новый ОчередьМассив;
	Очередь.Добавить(2);

	// Когда
	Попытка
		Ожидаем.Что(Очередь)
			.Содержит(1);
	Исключение
		БылоИсключение = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;

	// Тогда
	ПроверитьИсключение(
		БылоИсключение,
		ОписаниеОшибки,
		"Ожидали, что проверяемое значение ([2]) СОДЕРЖИТ (1)"
	);

КонецПроцедуры

&Тест
Процедура ОжидаемСодержитВКарте() Экспорт

	// Дано
	Карта = Новый КартаСоответствие;
	Карта.Вставить(1, 1);

	// Когда
	Ожидаем.Что(Карта)
		.Содержит(1);

	// Тогда

КонецПроцедуры

&Тест
Процедура ОжидаемНеСодержитВКарте() Экспорт

	// Дано
	БылоИсключение = Ложь;

	Карта = Новый КартаСоответствие;
	Карта.Вставить(1, 2);

	// Когда
	Попытка
		Ожидаем.Что(Карта)
			.Содержит(1);
	Исключение
		БылоИсключение = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;

	// Тогда
	ПроверитьИсключение(
		БылоИсключение,
		ОписаниеОшибки,
		"Ожидали, что проверяемое значение ({1=2}) СОДЕРЖИТ (1)"
	);

КонецПроцедуры

Процедура ПроверитьИсключение(БылоИсключение, ОписаниеОшибки, ИскомыйТекстИсключения)

	Контекст = Новый ИсключениеОшибкаУтверждения();

	Если Не БылоИсключение Тогда

		ВызватьИсключение Новый ИнформацияОбОшибке(
			"Ожидали, что будет исключение а это не так",
			Контекст
		);

	КонецЕсли;

	Если СтрНайти(ОписаниеОшибки, ИскомыйТекстИсключения) = 0 Тогда

		ВызватьИсключение Новый ИнформацияОбОшибке(
			СтрШаблон(
				"Ожидали, что в тексте ошибки будет текст: { %1 }, а был { %2 }",
				ИскомыйТекстИсключения,
				ОписаниеОшибки
			),
			Контекст
		);

	КонецЕсли;

КонецПроцедуры
